tap "amiaopensource/amiaos"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
# New file format for still image compression
brew "jpeg-xl"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Full-featured MP4 format and MPEG DASH library and tools
brew "bento4"
# Fish completion for brew-cask
brew "brew-cask-completion"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Terminal visual disk space navigator
brew "diskonaut"
# More intuitive version of du in rust
brew "dust"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Command-line downloader for image-hosting site galleries and collections
brew "gallery-dl"
# WebDriver <-> Marionette proxy
brew "geckodriver"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Multimedia framework for research and academic purposes
brew "gpac", link: false
# LLVM's OpenMP runtime library
brew "libomp", link: true
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Image loading and rendering library
brew "imlib2"
# Postgres C API library
brew "libpq"
# Library to render SVG files using Cairo
brew "librsvg"
# Next-gen compiler infrastructure
brew "llvm"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Text-based web browser
brew "lynx"
# Mac App Store command-line interface
brew "mas"
# Command-line client for Mega.co.nz
brew "megatools"
# Read, create, and modify MP4 files
brew "mp4v2", link: false
# Fast, highly customisable system info script
brew "neofetch"
# Platform built on V8 to build network applications
brew "node"
# Libraries for security-enabled client and server applications
brew "nss"
# Tools for one-time password authentication systems
brew "oath-toolkit"
# Command-line tool to generate, analyze, convert and manipulate colors
brew "pastel"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Python package management tool
brew "poetry"
# Object-relational database system
brew "postgresql@14"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Utility that provides fast incremental file transfer
brew "rsync"
# Safe, concurrent, practical language
brew "rust"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Version control system designed to be a better CVS
brew "subversion"
# Generate scripting interfaces to C/C++ code
brew "swig"
# Manipulate and query tags on macOS files
brew "tag"
# Internet file retriever
brew "wget"
# Fork of youtube-dl with additional features and fixes
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Control every piece of your controller
cask "8bitdo-ultimate-software"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
# Tool to run Windows software
cask "crossover"
# Server and cloud storage browser
cask "cyberduck"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Voice and text chat software
cask "discord"
# Data recovery software
cask "disk-drill"
# Emulator to play GameCube and Wii games
cask "dolphin"
# Web browser
cask "firefox"
# Digital audio production application
cask "fl-studio"
cask "font-open-sans"
# Elegant sans-serif font family, now 9 weights and italic style
cask "font-raleway"
# Font with a mechanical skeleton and the forms are largely geometric
cask "font-roboto"
# Disk space cleaner that finds and deletes duplicated and similar files
cask "gemini"
# Client for the Google Drive storage service
cask "google-drive"
# Free and open-source media player
cask "iina"
# Tool to scan a website checking for broken links
cask "integrity"
# Professional audio software for audio recording, mixing, broadcast and others
cask "izotope-product-portal"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# File archiver
cask "keka"
# Automator software to start apps, run scripts or commands and more
cask "lingon-x"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Minimal installer for conda
cask "miniconda"
# Web browser focused on privacy and on minimizing tracking and fingerprinting
cask "mullvad-browser"
# Network monitor
cask "netiquette"
# Cloud gaming platform
cask "nvidia-geforce-now"
# Open-source software for live streaming and screen recording
cask "obs"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Retro video game emulation
cask "openemu"
# Web browser
cask "opera"
# Customise and maintain app icons
cask "pictogram"
# Command-line shell and scripting language
cask "powershell"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Control your tools with a few keystrokes
cask "raycast"
# Open source virtual/remote desktop application
cask "rustdesk"
# Download manager for Spitfire audio libraries
cask "spitfire-audio"
# Video game digital distribution service
cask "steam"
# Git client
cask "sublime-merge"
# Text editor for code, markup and prose
cask "sublime-text"
# Application for inspecting installer packages
cask "suspicious-package"
# Charting and social-networking for investment traders
cask "tradingview"
# Rust-based terminal
cask "warp"
# Client to install and activate Waves products
cask "waves-central"
# Comic reader
cask "yacreader"
mas "Bitwarden", id: 1352778147
mas "Crontab Creator", id: 1438725196
mas "DaVinci Resolve Studio", id: 900392332
mas "Draw Things", id: 6444050820
mas "Infuse", id: 1136220934
mas "Microsoft Excel", id: 462058435
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Sasquatch", id: 1465346522
mas "SonicWall Mobile Connect", id: 822514576
mas "Soundify", id: 1636875630
mas "Step Two", id: 1448916662
mas "The Unarchiver", id: 425424353
mas "Today", id: 6443714928
mas "Vivid", id: 6443470555
