tap "homebrew/bundle"
tap "homebrew/services"
# New file format for still image compression
brew "jpeg-xl"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Fish completion for brew-cask
brew "brew-cask-completion"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Console Matrix
brew "cmatrix"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Terminal visual disk space navigator
brew "diskonaut"
# More intuitive version of du in rust
brew "dust"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line downloader for image-hosting site galleries and collections
brew "gallery-dl"
# WebDriver <-> Marionette proxy
brew "geckodriver"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# LLVM's OpenMP runtime library
brew "libomp", link: true
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Next-gen compiler infrastructure
brew "llvm"
# Mac App Store command-line interface
brew "mas"
# Command-line client for Mega.co.nz
brew "megatools"
# Matroska media files manipulation tools
brew "mkvtoolnix"
# Read, create, and modify MP4 files
brew "mp4v2"
# Platform built on V8 to build network applications
brew "node"
# Libraries for security-enabled client and server applications
brew "nss"
# Tools for one-time password authentication systems
brew "oath-toolkit"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Safe, concurrent, practical language
brew "rust"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Manipulate and query tags on macOS files
brew "tag"
# Internet file retriever
brew "wget"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Control every piece of your controller
cask "8bitdo-ultimate-software"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Chromium based browser
cask "arc"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
# Tool to run Windows software
cask "crossover"
# Server and cloud storage browser
cask "cyberduck"
# Voice and text chat software
cask "discord"
# Data recovery software
cask "disk-drill"
# Emulator to play GameCube and Wii games
cask "dolphin"
# Web browser
cask "firefox"
cask "font-open-sans"
cask "font-raleway"
# Disk space cleaner that finds and deletes duplicated and similar files
cask "gemini"
# Client for the Google Drive storage service
cask "google-drive"
# Free and open-source media player
cask "iina"
# Tool to scan a website checking for broken links
cask "integrity"
# Professional audio software for audio recording, mixing, broadcast and others
cask "izotope-product-portal"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# File archiver
cask "keka"
# Tool to show what is persistently installed on the computer
cask "knockknock"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Network monitor
cask "netiquette"
# Cloud gaming platform
cask "nvidia-geforce-now"
# Open-source software for live streaming and screen recording
cask "obs"
# Retro video game emulation
cask "openemu"
# Customise and maintain app icons
cask "pictogram"
# Command-line shell and scripting language
cask "powershell"
# Control your tools with a few keystrokes
cask "raycast"
# Download manager for Spitfire audio libraries
cask "spitfire-audio"
# Video game digital distribution service
cask "steam"
# Git client
cask "sublime-merge"
# Text editor for code, markup and prose
cask "sublime-text"
# Application for inspecting installer packages
cask "suspicious-package"
# Charting and social-networking for investment traders
cask "tradingview"
# Rust-based terminal
cask "warp"
# Client to install and activate Waves products
cask "waves-central"
# Comic reader
cask "yacreader"
mas "Bitwarden", id: 1352778147
mas "compressum", id: 6479709701
mas "Convertum", id: 6480382704
mas "Crontab Creator", id: 1438725196
mas "DaVinci Resolve Studio", id: 900392332
mas "Draw Things", id: 6444050820
mas "Infuse", id: 1136220934
mas "Microsoft Excel", id: 462058435
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Sasquatch", id: 1465346522
mas "SonicWall Mobile Connect", id: 822514576
mas "Step Two", id: 1448916662
mas "The Unarchiver", id: 425424353
mas "Today", id: 6443714928
mas "Vivid", id: 6443470555
