tap "bionus/imgbrd-grabber"
# Library for manipulating PNG images
brew "libpng"
# New file format for still image compression
brew "jpeg-xl"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Software library to render fonts
brew "freetype"
# Low-level library for pixel manipulation
brew "pixman"
# Vector graphics library with cross-device output support
brew "cairo"
# Console Matrix
brew "cmatrix"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Terminal visual disk space navigator
brew "diskonaut"
# More intuitive version of du in rust
brew "dust"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line downloader for image-hosting site galleries and collections
brew "gallery-dl"
# WebDriver <-> Marionette proxy
brew "geckodriver"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# LLVM's OpenMP runtime library
brew "libomp", link: true
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Next-gen compiler infrastructure
brew "llvm"
# Mac App Store command-line interface
brew "mas"
# Command-line client for Mega.co.nz
brew "megatools"
# Small build system for use with gyp or CMake
brew "ninja"
# Fast and user friendly build system
brew "meson"
# Matroska media files manipulation tools
brew "mkvtoolnix"
# Read, create, and modify MP4 files
brew "mp4v2"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Libraries for security-enabled client and server applications
brew "nss"
# Tools for one-time password authentication systems
brew "oath-toolkit"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Python version management
brew "pyenv"
# Safe, concurrent, practical language
brew "rust"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Manipulate and query tags on macOS files
brew "tag"
# Internet file retriever
brew "wget"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Control every piece of your controller
cask "8bitdo-ultimate-software"
# Chromium based browser
cask "arc"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
# Tool to run Windows software
cask "crossover"
# Server and cloud storage browser
cask "cyberduck"
# Scans for dylib hijacking
cask "dhs"
# Data recovery software
cask "disk-drill"
# Emulator to play GameCube and Wii games
cask "dolphin"
# Web browser
cask "firefox"
cask "font-open-sans"
cask "font-raleway"
# Disk space cleaner that finds and deletes duplicated and similar files
cask "gemini"
# Free and open-source media player
cask "iina"
# Tool to scan a website checking for broken links
cask "integrity"
# Professional audio software for audio recording, mixing, broadcast and others
cask "izotope-product-portal"
# Remote desktop application
cask "jump-desktop"
# Remote desktop app
cask "jump-desktop-connect"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# File archiver
cask "keka"
# Tool to show what is persistently installed on the computer
cask "knockknock"
# Discover, download, and run local LLMs
cask "lm-studio"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Network monitor
cask "netiquette"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# Customise and maintain app icons
cask "pictogram"
# Home media player
cask "plex"
# Command-line shell and scripting language
cask "powershell"
# VPN client focusing on security
cask "protonvpn"
# HTTP debugging proxy
cask "proxyman"
# Control your tools with a few keystrokes
cask "raycast"
# Language and framework for policy as code
cask "sentinel"
# Download manager for Spitfire audio libraries
cask "spitfire-audio"
# Video game digital distribution service
cask "steam"
# Git client
cask "sublime-merge"
# Text editor for code, markup and prose
cask "sublime-text"
# Application for inspecting installer packages
cask "suspicious-package"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Charting and social-networking for investment traders
cask "tradingview"
# 3D printer and slicing GUI
cask "ultimaker-cura"
# Rust-based terminal
cask "warp"
# Client to install and activate Waves products
cask "waves-central"
mas "Affinity Photo 2", id: 1616822987
mas "compressum", id: 6479709701
mas "Convertum", id: 6480382704
mas "DaVinci Resolve Studio", id: 900392332
mas "Draw Things", id: 6444050820
mas "Infuse", id: 1136220934
mas "Logic Pro", id: 634148309
mas "Microsoft Excel", id: 462058435
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Sasquatch", id: 1465346522
mas "SonicWall Mobile Connect", id: 822514576
mas "The Unarchiver", id: 425424353
mas "Today", id: 6443714928
mas "Vivid", id: 6443470555
mas "Windows App", id: 1295203466
